mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE984x_DFP.1.2.0.pdsc
  </conditions>

  <boards>
    <board vendor="Infineon" name="TLE984x Eval.Board Rev1.4" revision="V1.0" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE984x Eval. Board Support and Examples</description>
      <image small="Images/TLE9844_EvalKit_v1_top_small.jpg" large="Images/TLE9844_EvalKit_v1_top_large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/tle984x" title="TLE9844 EvalKit Web Page"/>
      <!--<book category="setup"     name="Documents/TLE9844-EvalBoard-UM-100-Infineon.pdf" title="Getting Started"/>-->
      <book category="schematic" name="Documents/TLE984x_EVB_Rev14_UM_rev10.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9844QX"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE984x Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="12" m="5"       name="POWER Connector for external supply"/>
        <feature type="DIO"       n="13"             name="Pins at pin headers"/>
        <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
        <feature type="LED"       n="8"              name="User LEDs"/>
        <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="TLE984x CMSIS Device">
      <description>System Startup for Infineon TLE984x device series</description>
      <files>
         <!-- startup files -->
        <file category="source"  name="Device/Source/ARM/startup_tle984x.s" attr="config" condition="TLE984x"   version="1.0"/>

        <!-- system file -->
        <file category="source"  name="Device/Source/system_tle984x.c"      attr="config" condition="TLE984x" version="1.1.1"/>
        <file category="source"  name="Device/Source/tle_device.c"          attr="config" condition="TLE984x" version="1.0.3"/>

        <file category="header"  name="Device/Include/system_tle984x.h"     attr="config" condition="TLE984x" version="1.1.1"/>
        <file category="header"  name="Device/Include/types.h"              attr="config" condition="TLE984x" version="0.2.3"/>
        <file category="header"  name="Device/Include/tle984x.h"            attr="config" condition="TLE984x" version="1.8"/>
        <file category="header"  name="Device/Include/tle_device.h"         attr="config" condition="TLE984x" version="1.0.3"/>
        <file category="header"  name="Device/Include/tle_variants.h"       attr="config" condition="TLE984x" version="0.1.0"/>
        <file category="header"  name="Device/Include/sfr_access.h"         attr="config" condition="TLE984x" version="0.1.0"/>
		
        <file category="sourceC" name="Device/SDK/app/main.c"  attr="template" select="Simple Main" condition="TLE984x" version="1.1.2"/>
        <file category="doc" name="Documents/html/index.html"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="ConfigWizard" Cversion="1.8.7" condition="Only ConfigWizard">
     <description>Infineon ConfigWizard Configuration File version 1.x</description>
     <files>
		<file category="header"  name="Device/SDK/cfgwiz/TLE9842QX/v1/bsl_defines.h"   attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE9842-2QX/v1/bsl_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE9843QX/v1/bsl_defines.h"   attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE9843-2QX/v1/bsl_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE9844QX/v1/bsl_defines.h"   attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE9844-2QX/v1/bsl_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE9845QX/v1/bsl_defines.h"   attr="config" condition="TLE9845QX" version="1.2.1"/>
        
        <file category="doc" name="Device/SDK/cfgwiz/TLE9842QX/v1/config.icwp" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE9842-2QX/v1/config.icwp" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE9843QX/v1/config.icwp" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE9843-2QX/v1/config.icwp" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE9844QX/v1/config.icwp" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE9844-2QX/v1/config.icwp" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE9845QX/v1/config.icwp" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/script/v1/IFX_TLE984x.xml" attr="config" condition="TLE984x" version="1.2.4"/>
		<file category="doc" name="SVD/TLE984x.svd" attr="config" condition="TLE984x" version="1.5.0"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/v1/adc1_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/v1/adc1_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9843QX/v1/adc1_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/v1/adc1_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9844QX/v1/adc1_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/v1/adc1_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9845QX/v1/adc1_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/v1/mon_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/v1/mon_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9843QX/v1/mon_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/v1/mon_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9844QX/v1/mon_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/v1/mon_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9845QX/v1/mon_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
		
