mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE984x_DFP.1.2.0.pdsc
			<file category="doc" name="Device/SDK/cfgwiz/TLE9842QX/v2/config.icwp" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="doc" name="Device/SDK/cfgwiz/TLE9842-2QX/v2/config.icwp" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="doc" name="Device/SDK/cfgwiz/TLE9843QX/v2/config.icwp" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="doc" name="Device/SDK/cfgwiz/TLE9843-2QX/v2/config.icwp" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="doc" name="Device/SDK/cfgwiz/TLE9844QX/v2/config.icwp" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="doc" name="Device/SDK/cfgwiz/TLE9844-2QX/v2/config.icwp" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="doc" name="Device/SDK/cfgwiz/TLE9845QX/v2/config.icwp" attr="config" condition="TLE9845QX" version="1.2.1"/>
			<file category="doc" name="Device/SDK/cfgwiz/script/v2/IFX_TLE984x.xml" 	attr="config" 						version="2.0.2"/>
			<file category="doc" name="Device/SDK/cfgwiz/script/v2/TLE984x.mig"     	attr="config" 						version="2.0.1"/>
			<file category="doc" name="SVD/TLE984x.svd" attr="config" 													version="1.5.0"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/v2/adc1_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/v2/adc1_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/v2/adc1_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/v2/adc1_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/v2/adc1_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/v2/adc1_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/v2/adc1_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/v2/mon_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/v2/mon_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/v2/mon_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/v2/mon_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/v2/mon_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/v2/mon_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/v2/mon_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/common/pmu_defines.h" attr="config" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/common/int_defines.h" attr="config" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/common/isr_defines.h" attr="config" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/common/lin_defines.h" attr="config" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/common/port_defines.h" attr="config" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/common/ls_defines.h" attr="config" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/hs_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/hs_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/hs_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/hs_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/hs_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/hs_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/hs_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/scu_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/scu_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/scu_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/scu_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/scu_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/scu_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/scu_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/adc2_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/adc2_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/adc2_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/adc2_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/adc2_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/adc2_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/adc2_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/ccu6_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/ccu6_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/ccu6_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/ccu6_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/ccu6_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/ccu6_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/ccu6_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/gpt12e_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/gpt12e_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/gpt12e_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/gpt12e_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/gpt12e_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/gpt12e_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/gpt12e_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/ssc_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/ssc_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/ssc_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/ssc_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/ssc_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/ssc_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/ssc_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/timer2x_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/timer2x_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/timer2x_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/timer2x_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/timer2x_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/timer2x_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/timer2x_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
			
			<file category="header" name="Device/SDK/cfgwiz/TLE9842QX/uart_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9842-2QX/uart_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843QX/uart_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9843-2QX/uart_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844QX/uart_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9844-2QX/uart_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
			<file category="header" name="Device/SDK/cfgwiz/TLE9845QX/uart_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
		</files>
        <RTE_Components_h>
          #define CONFIGWIZARD 2
        </RTE_Components_h>
    </component>

