mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE984x_DFP.1.2.0.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.3.5" condition="TLE984x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SCU
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/scu.h" version="0.3.5"/>
        <file category="source" attr="config" name="Device/SDK/src/scu.c" version="0.3.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" Cversion="1.5.2" condition="TLE984x CMSIS Device">
      <description>BootROM driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_BROM
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/bootrom.h" version="1.5.2"/>
        <file category="source" attr="config" name="Device/SDK/src/bootrom.c" version="1.5.2"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.8" condition="TLE984x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_WDT1
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/wdt1.h" version="0.2.8"/>
        <file category="source" attr="config" name="Device/SDK/src/wdt1.c" version="0.2.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PMU" Cversion="0.1.5" condition="TLE984x CMSIS Device">
      <description>Power Management Unit (SCU) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PMU
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/pmu.h" version="0.1.5"/>
        <file category="source" attr="config" name="Device/SDK/src/pmu.c" version="0.1.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC1" Cversion="0.1.9" condition="TLE984x CMSIS Device">
      <description>Analog Digital Converter 1 (ADC1) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC1
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/adc1.h" version="0.1.9"/>
        <file category="source" attr="config" name="Device/SDK/src/adc1.c" version="0.1.9"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC2" Cversion="0.1.8" condition="TLE984x CMSIS Device">
      <description>Analog Digital Converter 2 (ADC2) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC2
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/adc2.h" version="0.1.8"/>
        <file category="source" attr="config" name="Device/SDK/src/adc2.c" version="0.1.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CCU6" Cversion="0.2.5" condition="TLE984x CMSIS Device">
      <description>Capture Compare Unit (CCU6) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_CCU6
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/ccu6.h" version="0.2.5"/>
        <file category="source" attr="config" name="Device/SDK/src/ccu6.c" version="0.2.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="HS" Cversion="0.1.9" condition="TLE984x CMSIS Device">
      <description>High Side driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_HS
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/hs.h" version="0.1.9"/>
        <file category="source" attr="config" name="Device/SDK/src/hs.c" version="0.1.9"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="LS" Cversion="0.1.6" condition="TLE984x CMSIS Device">
      <description>Low Side driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_LS
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/ls.h" version="0.1.6"/>
        <file category="source" attr="config" name="Device/SDK/src/ls.c" version="0.1.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" Cversion="0.1.6" condition="TLE984x CMSIS Device">
      <description>General Purpose Timer 12E (GPT12E) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_GPT12E
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/gpt12e.h" version="0.1.6"/>
        <file category="source" attr="config" name="Device/SDK/src/gpt12e.c" version="0.1.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="INT" Cversion="0.1.6" condition="TLE984x CMSIS Device">
      <description>Interrupt (INT) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_INT
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/int.h" version="0.1.6"/>
        <file category="source" attr="config" name="Device/SDK/src/int.c" version="0.1.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ISR" Cversion="0.2.1" condition="TLE984x CMSIS Device">
      <description>Interrupt Service Routines (ISR) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ISR
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/isr.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/isr.c" version="0.2.1"/>
      </files>
    </component>

