mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE984x_DFP.1.2.0.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="LIN" Cversion="0.1.6" condition="TLE984x CMSIS Device">
      <description>LIN Tranceiver (LIN) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_LIN
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/lin.h" version="0.1.6"/>
        <file category="source" attr="config" name="Device/SDK/src/lin.c" version="0.1.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="MON" Cversion="0.1.8" condition="TLE984x CMSIS Device">
      <description>High Voltage Monitor Input (MON) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_MON
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/mon.h" version="0.1.8"/>
        <file category="source" attr="config" name="Device/SDK/src/mon.c" version="0.1.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PORT" Cversion="0.6.3" condition="TLE984x CMSIS Device">
      <description>GPIO Ports (PORT) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PORT
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/port.h" version="0.6.3"/>
        <file category="source" attr="config" name="Device/SDK/src/port.c" version="0.6.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SSC" Cversion="0.1.5" condition="TLE984x CMSIS Device">
      <description>High Speed Synchronous Serial Interface 1 and 2 (SSC) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SSC
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/ssc.h" version="0.1.5"/>
        <file category="source" attr="config" name="Device/SDK/src/ssc.c" version="0.1.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" Cversion="0.1.5" condition="TLE984x CMSIS Device">
      <description>Timer2 and Timer21 (TIMER2x) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER2X
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/timer2x.h" version="0.1.5"/>
        <file category="source" attr="config" name="Device/SDK/src/timer2x.c" version="0.1.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="UART" Cversion="0.1.7" condition="TLE984x CMSIS Device">
      <description>UART1 and UART2 (UART) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_UART
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/uart.h" version="0.1.7"/>
        <file category="source" attr="config" name="Device/SDK/src/uart.c" version="0.1.7"/>
      </files>
    </component>
  </components>
  
  <examples>
    <example name="PMU_POWERSAVING_SLEEPMODE" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/PMU_POWERSAVING_SLEEPMODE_EXAMPLE_TLE984x/">
      <description>Power Saving Modes - Sleep Mode</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_POWERSAVING_SLEEPMODE.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="MON"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="BLINKY" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/BLINKY_EXAMPLE_TLE984x/">
      <description>Blinky - blinks LED1</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="BLINKY.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>

        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="PMU_POWERSAVING_STOPMODE" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/PMU_POWERSAVING_STOPMODE_EXAMPLE_TLE984x/">
      <description>Power Saving Modes - Stop Mode</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_POWERSAVING_STOPMODE.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="MON"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="PMU_POWERSAVING_SLEEPMODE_CYCLICWAKE" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/PMU_POWERSAVING_SLEEPMODE_CYCLICWAKE_EXAMPLE_TLE984x/">
      <description>Power Saving Modes - Sleep Mode with cyclic wake</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_POWERSAVING_SLEEPMODE_CYCLICWAKE.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="MON"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="PMU_RESET_STATUS" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/PMU_RESET_STATUS_EXAMPLE_TLE984x/">
      <description>Reset Status Evaluation</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_RESET_STATUS.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="MON"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="PMU_VDDEXT" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/PMU_VDDEXT_EXAMPLE_TLE984x/">
      <description>VDDEXT handling</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_VDDEXT.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="MON"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="SCU_PLL" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/SCU_PLL_EXAMPLE_TLE984x/">
      <description>PLL adjustment</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SCU_PLL.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="SCU_PLL_XTAL" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/SCU_PLL_XTAL_EXAMPLE_TLE984x/">
      <description>PLL with external XTAL</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SCU_PLL_XTAL.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="NVM_PROGRAMMING" doc="Abstract.txt" folder="Boards/Infineon/TLE984x_EvalBoard/NVM_PROGRAMMING_EXAMPLE_TLE984x/">
      <description>NVM Page Programming</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="NVM_PROGRAMMING.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="ConfigWizard_v2"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

